git init=инициалищация нового репозитория
git remote add(name url)https _ssh key=используется для создания записи о новом подключении к удаленному репозиторию
git pull-стягивают изменения с какой либо ветки git pull origin master
git status=статус файлов в проекте 
git add назв_файла=добавляют файлы в индекс
git commit=делает для проекта снимок текущего состояния изменений,добавленных в раздел проиндексированных файлов.
git commit -m "комментарий"
git branch=просмотр список веток и выбор ветки
git branch name_branch=создать новую ветку
git checkout name_branch=переключение на ветку с именем name_branch
git push origin master=используется для выгрузки содержимого локального репозитория в удаленный репозиторий
git reset filename=отмена изменений в разделе проиндексированных файлов

